app/controllers/v1/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Visit Narnia"], ["done", 0], ["todo_id", 1], ["created_at", "2024-02-23 20:03:16.529931"], ["updated_at", "2024-02-23 20:03:16.529931"]]
---
    def create
      @todo.items.create!(item_params)

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Mozart"], ["updated_at", "2024-02-23 20:03:17.014013"], ["id", 1]]
---
    def update
      @item.update(item_params)