app/controllers/v1/todos_controller.rb

    def create
      # create todos belonging to current user
      @todo = current_user.todos.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", "2024-02-23 20:03:17.423122"], ["updated_at", "2024-02-23 20:03:17.423122"]]